all_grades = ["No_work", "Intern", "Junior", "Middle", "Senior", "Без грейда"] # спасибо дане душеневу за баг на 40 минут времени =)))))))))))
all_spheres = ["NLP", "CV", "RecSys", "Audio", "Classic_ML", "Any"]
NoneData = ""

TEACHER_DATA = """
Имя: {}
Уровень: {}
Сфера: {}

{}

провел занятий - {}
пропустил занятий - {}
{}
"""

TEACHER_DATA_sign_up = """
*уже в календаре =)*

Имя: {}
Уровень: {}
Сфера: {}

{}

провел занятий - {}
пропустил занятий - {}
{}
"""

ALL_OKAY_TEXT = """
Все изменения внесены

Вот список функций, которые вы можете использовать для поиска собеседований:

⚙️ Регистрация/изменение данных - заполнить или изменить свою информацию.

🔍 Поиск - поиск людей, с которыми можно пройти собеседование

🗓 Настройки календаря - просмотр и отмена записей
"""

DATA = """
Ваши данные
Имя: {}
Уровень: {}
Сфера: {}
Описание: 
{}
"""

INFO_TEXT = """
Вот список функций, которые вы можете использовать для поиска собеседований:

⚙️ Регистрация/изменение данных - заполнить или изменить свою информацию.

🔍 Поиск - поиск людей, с которыми можно пройти собеседование

🗓 Настройки календаря - просмотр и отмена записей
"""

FILTER_DATA = """
В данный момент выбраны фильтры:

Уровень:   {}

Сфера:   {}
"""

HELLO = """
Привет! Твоя анкета:

Имя: {}
Уровень: {}
Сфера: {}
Описание: 
{}
"""

START_MESSAGE="""Привет! Это бот от AI Knowledge Club для поиска собеседований и мок-интервью⚡️

Выберите свою роль:
"""